## for - оператор циклу. Ітерація - набір дій, що виконує цикл за одне коле
## for змінна_циклу in щось:
##      тіло циклу
##щось - це може бути range, список, словник
##на кожній ітерації в змінну_циклу записується наступне значення з щось
## range (start, stop) - [start, stop). Генерує діапазон від start (включно) до stop(не включаємо)
# range(1,10) = [1,10): 1,2,3,4,5,6,7,8,9
## range (start, stop) - [start, stop, step). Діапазон від start (включно) до stop(не включаємо) з кроком step
# range(1,10,3) = [1,10): 1,4,7
# range(10,1,-2) = [10,1): 10,8,6,4,2
# Задано діапазон чисел від 1 до 20. Вивести їх на екран.
for i in range(1, 21):
    if i % 2 == 0:
        print(i)